Revit 2027 API
ExternalApplicationArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ExternalApplicationArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As ExternalApplicationArrayIterator
public:
virtual ExternalApplicationArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ExternalApplicationArrayIterator
override ForwardIterator : unit -> ExternalApplicationArrayIterator
Return Value
ExternalApplicationArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace